def demo_unicode():
    s = "I love Thailand."
    print(s)
    t = "I \u2764 Thailand."        # unicode 16-bit \u0000
    print(t)

    # unicode 32-bit Emoji \U00000000
    z = "I \u2764 Thailand. \U0001f600 \U0001f920"
    print(z)

def demo_multiline_string():
    # ref: https://lyrics.lyricfind.com/
    lyric = """ แค่ได้เจอ ก็รู้ในทันที ว่าในใจเธอ ไม่เหลือภาพเดิมเดิม
ในวันนั้นเราฝันหาถึงงานวิวาห์
ในวันนี้ในแววตาเธอเพียงแค่ต้องการลา
และไม่เป็นไร ก็รู้และเข้าใจ เธอเก็บออกไป ข้าวของฉันในใจ
ทุกความรู้สึกทุกคำทุกความทรงจำทุกสิ่งที่เธอเคยทำ
เธอคงไม่ต้องการมัน
เธอไม่ต้องบอกหรอกว่าเธอจะลา
ไม่ต้องมาบอกหรอกว่ามีน้ำตา
ฉันจะนับในใจ ไปซ่อนไว้ให้ไกลและไม่ต้องกลับมา
ไม่ใช่เธอก็ไม่เป็นไรหรอกนะ
ไม่ต้องทนอยู่เพื่อรอวันจากลา
ไม่ว่าเธออยู่ที่ใดจะไม่ตามหา
Ah ah won’t find you
ไม่ใช่เธอก็ไม่เป็นไรหรอกนะ
ขอให้เธอมีชีวิตที่ตามหา
ส่วนฉันจะซ่อนทุกความสุขที่ผ่านมา
Ah พอฉันลืมตาขอให้ไม่เจอ
เหนื่อยเท่าไหร่ ที่วิ่งตามเธอไป
จะจบเมื่อไหร่ เคยถามข้างในใจ
เธอซ่อนแล้วให้ฉันหา เธอกลับคืนมา
มันเป็นแค่ภาพลวงตา ที่ติดในห้วงเวลา
ถ้าจะไป ตัวฉันก็เข้าใจ
จะอยู่ให้ไหว เธอไม่ต้องสนใจ
ไม่ว่าได้ยินอะไร ให้เธอเดินไป
ไม่ว่าจะดังเท่าไหร่ นั่นไม่ใช่เสียงของน้ำตา
เธอไม่ต้องบอกหรอกว่าเธอจะลา
ไม่ต้องมาบอกหรอกว่ามีน้ำตา
ฉันจะนับในใจ ไปซ่อนไว้ให้ไกลและไม่ต้องกลับมา
ไม่ใช่เธอก็ไม่เป็นไรหรอกนะ
ไม่ต้องทนอยู่เพื่อรอวันจากลา
ไม่ว่าเธออยู่ที่ใดจะไม่ตามหา
Ah ah won’t find you
ไม่ใช่เธอก็ไม่เป็นไรหรอกนะ
ขอให้เธอมีชีวิตที่ตามหา
ส่วนฉันจะซ่อนทุกความสุขที่ผ่านมา
Ah พอฉันลืมตาขอให้ไม่เจอ
ฉันจะซ่อนความเสียใจ ด้วยคำว่าไม่เป็นไร
ซ่อนเธอให้ลึกเข้าไป ไม่ว่าจะต้องร้องไห้แค่ไหน จะไม่ตามหา
ไม่ใช่เธอก็ไม่เป็นไรหรอกนะ
ไม่ต้องทนอยู่เพื่อรอวันจากลา
ไม่ว่าเธออยู่ที่ใดจะไม่ตามหา
Ah ah won’t find you
ไม่ใช่เธอก็ไม่เป็นไรหรอกนะ
ขอให้เธอมีชีวิตที่ตามหา
ส่วนฉันจะซ่อนทุกความสุขที่ผ่านมา
Ah พอฉันลืมตาขอให้ไม่เจอ"""
    print(lyric)

demo_multiline_string()
